project/app/controllers/user_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    user= User.all

INSERT INTO `users` (`nombre`, `apellido`, `password`, `username`, `email`, `created_at`, `updated_at`) VALUES ('Luis', 'Espinoza', 'Luis5014', 'espinozaluis3680@gmail.com', 'espinozaluis3680@gmail.com', '2017-07-30 20:58:58', '2017-07-30 20:58:58')
---
  def create
    user= User.new
    user.nombre=params[:nombre]
    user.apellido=params[:apellido]
    user.password=params[:password]
    user.email=params[:email]
    user.username=params[:username]

    if user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
---
  def update
    user= User.find_by id:(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1
---
  def destroy
    user=User.find_by id:(params[:id])
    if user != nil
      if user.destroy